jmeter-tests/stepping-load-test.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.6.3">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="REST API Stepping Load Test" enabled="true">
      <stringProp name="TestPlan.comments">Stepping load test that doubles threads every 2 minutes (1→4096)</stringProp>
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.tearDown_on_shutdown">true</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
        <collectionProp name="Arguments.arguments">
          <elementProp name="HOST" elementType="Argument">
            <stringProp name="Argument.name">HOST</stringProp>
            <stringProp name="Argument.value">${__P(host,perf-test-api-product-sandbox-chris.nanogw.apps.bubble.hur.hdclab.intranet.ibm.com)}</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="PORT" elementType="Argument">
            <stringProp name="Argument.name">PORT</stringProp>
            <stringProp name="Argument.value">${__P(port,443)}</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="PROTOCOL" elementType="Argument">
            <stringProp name="Argument.name">PROTOCOL</stringProp>
            <stringProp name="Argument.value">${__P(protocol,https)}</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="STEP_DURATION" elementType="Argument">
            <stringProp name="Argument.name">STEP_DURATION</stringProp>
            <stringProp name="Argument.value">${__P(step_duration,120)}</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
            <stringProp name="Argument.desc">Duration of each step in seconds (default: 120 = 2 minutes)</stringProp>
          </elementProp>
          <elementProp name="TOTAL_STEPS" elementType="Argument">
            <stringProp name="Argument.name">TOTAL_STEPS</stringProp>
            <stringProp name="Argument.value">${__P(total_steps,13)}</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
            <stringProp name="Argument.desc">Total number of steps (default: 13 for 1→4096)</stringProp>
          </elementProp>
          <elementProp name="SLEEP_TIME" elementType="Argument">
            <stringProp name="Argument.name">SLEEP_TIME</stringProp>
            <stringProp name="Argument.value">${__P(sleep_time,0.03)}</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="PAYLOAD_SIZE" elementType="Argument">
            <stringProp name="Argument.name">PAYLOAD_SIZE</stringProp>
            <stringProp name="Argument.value">${__P(payload_size,1024)}</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
        </collectionProp>
      </elementProp>
    </TestPlan>
    <hashTree>
      <kg.apc.jmeter.threads.UltimateThreadGroup guiclass="kg.apc.jmeter.threads.UltimateThreadGroupGui" testclass="kg.apc.jmeter.threads.UltimateThreadGroup" testname="Ultimate Thread Group (1→128)">
        <collectionProp name="ultimatethreadgroupdata">
          <collectionProp name="-1640798820">
            <stringProp name="1">1</stringProp>
            <stringProp name="0">0</stringProp>
            <stringProp name="30">30</stringProp>
            <stringProp name="120">120</stringProp>
            <stringProp name="10">10</stringProp>
          </collectionProp>
          <collectionProp name="2022137882">
            <stringProp name="2">2</stringProp>
            <stringProp name="150">150</stringProp>
            <stringProp name="30">30</stringProp>
            <stringProp name="120">120</stringProp>
            <stringProp name="10">10</stringProp>
          </collectionProp>
          <collectionProp name="-202295332">
            <stringProp name="4">4</stringProp>
            <stringProp name="300">300</stringProp>
            <stringProp name="30">30</stringProp>
            <stringProp name="120">120</stringProp>
            <stringProp name="10">10</stringProp>
          </collectionProp>
          <collectionProp name="1201456588">
            <stringProp name="8">8</stringProp>
            <stringProp name="450">450</stringProp>
            <stringProp name="30">30</stringProp>
            <stringProp name="120">120</stringProp>
            <stringProp name="10">10</stringProp>
          </collectionProp>
          <collectionProp name="604519792">
            <stringProp name="16">16</stringProp>
            <stringProp name="600">600</stringProp>
            <stringProp name="30">30</stringProp>
            <stringProp name="120">120</stringProp>
            <stringProp name="10">10</stringProp>
          </collectionProp>
          <collectionProp name="-391630492">
            <stringProp name="32">32</stringProp>
            <stringProp name="750">750</stringProp>
            <stringProp name="30">30</stringProp>
            <stringProp name="120">120</stringProp>
            <stringProp name="10">10</stringProp>
          </collectionProp>
          <collectionProp name="647659508">
            <stringProp name="64">64</stringProp>
            <stringProp name="900">900</stringProp>
            <stringProp name="30">30</stringProp>
            <stringProp name="120">120</stringProp>
            <stringProp name="10">10</stringProp>
          </collectionProp>
          <collectionProp name="1939462404">
            <stringProp name="128">128</stringProp>
            <stringProp name="1050">1050</stringProp>
            <stringProp name="30">30</stringProp>
            <stringProp name="120">120</stringProp>
            <stringProp name="10">10</stringProp>
          </collectionProp>
        </collectionProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller">
          <intProp name="LoopController.loops">-1</intProp>
          <boolProp name="LoopController.continue_forever">false</boolProp>
        </elementProp>
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
      </kg.apc.jmeter.threads.UltimateThreadGroup>
      <hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="POST /1.0.0/perf/test">
          <stringProp name="HTTPSampler.domain">${HOST}</stringProp>
          <stringProp name="HTTPSampler.port">${PORT}</stringProp>
          <stringProp name="HTTPSampler.protocol">${PROTOCOL}</stringProp>
          <stringProp name="HTTPSampler.contentEncoding">UTF-8</stringProp>
          <stringProp name="HTTPSampler.path">/1.0.0/perf/test?sleep_time=${SLEEP_TIME}</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">{&#xd;
  &quot;timestamp&quot;: &quot;${__time(yyyy-MM-dd&apos;T&apos;HH:mm:ss.SSS&apos;Z&apos;,)}&quot;,&#xd;
  &quot;test_id&quot;: &quot;${__UUID()}&quot;,&#xd;
  &quot;thread&quot;: &quot;${__threadNum()}&quot;,&#xd;
  &quot;iteration&quot;: &quot;${__counter(FALSE,)}&quot;,&#xd;
  &quot;payload_size&quot;: ${PAYLOAD_SIZE},&#xd;
  &quot;data&quot;: &quot;${__RandomString(${PAYLOAD_SIZE},abcdefghijklmnopqrstuvwxyzABCDEFGHIJKLMNOPQRSTUVWXYZ0123456789,)}&quot;&#xd;
}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
        </HTTPSamplerProxy>
        <hashTree>
          <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP Header Manager">
            <collectionProp name="HeaderManager.headers">
              <elementProp name="" elementType="Header">
                <stringProp name="Header.name">Content-Type</stringProp>
                <stringProp name="Header.value">application/json</stringProp>
              </elementProp>
              <elementProp name="" elementType="Header">
                <stringProp name="Header.name">Host</stringProp>
                <stringProp name="Header.value">perf-test-api-product-sandbox-chris.nanogw.apps.bubble.hur.hdclab.intranet.ibm.com</stringProp>
              </elementProp>
            </collectionProp>
          </HeaderManager>
          <hashTree/>
          <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="Response Code Assertion">
            <collectionProp name="Asserion.test_strings">
              <stringProp name="49586">200</stringProp>
            </collectionProp>
            <stringProp name="Assertion.test_field">Assertion.response_code</stringProp>
            <boolProp name="Assertion.assume_success">false</boolProp>
            <intProp name="Assertion.test_type">8</intProp>
          </ResponseAssertion>
          <hashTree/>
          <JSONPathAssertion guiclass="JSONPathAssertionGui" testclass="JSONPathAssertion" testname="JSON Status Assertion">
            <stringProp name="JSON_PATH">$.status</stringProp>
            <stringProp name="EXPECTED_VALUE">success</stringProp>
            <boolProp name="JSONVALIDATION">true</boolProp>
            <boolProp name="EXPECT_NULL">false</boolProp>
            <boolProp name="INVERT">false</boolProp>
            <boolProp name="ISREGEX">false</boolProp>
          </JSONPathAssertion>
          <hashTree/>
        </hashTree>
        <ConstantTimer guiclass="ConstantTimerGui" testclass="ConstantTimer" testname="Think Time">
          <stringProp name="ConstantTimer.delay">100</stringProp>
        </ConstantTimer>
        <hashTree/>
      </hashTree>
      <ResultCollector guiclass="SummaryReport" testclass="ResultCollector" testname="Summary Report">
        <boolProp name="ResultCollector.error_logging">false</boolProp>
      </ResultCollector>
      <hashTree/>
    </hashTree>
  </hashTree>
</jmeterTestPlan>